[{
  "_id": "61ba4417591ee9186390a4f0",
  "isbn": "9781393495574",
  "id": "the-accursed-god",
  "title": "The Accursed God",
  "author": "Vivek Dutta Mishra",
  "pages": "380",
  "rating": "4.9",
  "votes": "49",
  "description": "THE LOST EPIC \n\n  The story of the epic battle of Kurukshetra has been told and retold for ages. Millennia of dust, fables, imaginations — and the epic itself is lost. What remained is the story of a family feud and ambition of Kauravas and Pandavas. But why, then, was this an epic war? Why entire Aryavart plunged into this first real world-war? Why the echo of this ancient war still resonates after all those centuries? Rediscover the lost epic whose origin lies in the birth of the Kurukshetra that had tasted its first blood over a hundred years before the final Mahabharata war. Discover the complete saga of Mahabharata which goes far and beyond just Kauravas and Pandavas and their ambitions.  THE ACCURSED GOD ================  Long before the epic battle, long before even the birth of Kurukshetra, a man swore on his father’s pyre to avenge against the mightiest empire, any civilization had ever seen. Between his might and near-certain destruction of the Empire, stood a warrior, who rose like a phoenix from the ashes of his seven dead brothers — taking the mantle of a fabled Accursed God.   In the clash that followed, Aryavart heard several more oaths by the side of more burning pyres, until, a young king decided that no price is too high for peace. Little did he know that the price would be a war engulfing the entire Aryavart, where few would live to tell the tale. And only one man can delay the inevitable if not prevent it. He is the accursed God and even he doesn’t know that destiny is like a quicksand, the more he tries to prevent it, the faster Aryavart moves towards the ultimate catastrophe.   Discover the saga of a man’s journey to that of a legendary and universally hated Accursed God, the saga of the ruthless ambitions and unfulfilled loves, endless deceits and vengeful oaths, and the saga of the battles to prevent the ultimate war.  TESTIMONIALS =============  When is the last time you finished a book and discover something? Here is a gripping and intriguing take on the greatest epic of all time through the eyes of its pivotal character that leaves your mind exhilarated, adding a fresh perspective to the tale that’s known, yet unknown. Throughout the fast action-packed book, the author masterfully blends politics, war and science and blurs the gap between love and hate, peace and war, and fiction and reality. A must-read novel which will leave you wanting for more. --- Colonel Avanish, Indian Army",
  "tags": [
    "epic",
    "indian",
    "mahabharata",
    "bhishma",
    "history"
  ],
  "series": "The Lost Epic",
  "seriesIndex": "1",
  "cover": "https://m.media-amazon.com/images/I/41-KqB1-cqL._SY346_.jpg",
  "reviews": [
    {
      "name": "Vidhya",
      "title": "Great Book of Epic Readers",
      "details": "Great Epic fiction based on Mahabharata. Must read",
      "rating": 5,
      "_id": "61ba4b79ed970f8bb2d31435"
    },
    {
      "name": "Akash",
      "title": "A completely new take",
      "details": "I know Mahabharata. But this is still amazing to read",
      "rating": 4,
      "_id": "61ba4b79ed970f8bb2d31436"
    },
    {
      "name": "Saroj",
      "title": "A Prequel to Mahabharata",
      "details": "If you think you know Mahabharata, Think again. Imagine a Mahabharata without Kaurava and Pandava",
      "rating": 5,
      "_id": "61ba4b79ed970f8bb2d31437"
    },
    {
      "name": "Lalit Narayana Mishra",
      "rating": 4,
      "comment": "This book is truly a masterpiece!",
      "title": "A True masterpiece"
    },
    {
      "name": "Sushant Rawat",
      "rating": 5,
      "comment": "This book is truly a masterpiece!",
      "title": "A True masterpiece"
    }
  ],
  "price": 179,
  "authorId": "vivek-dutta-mishra"
},
{
  "_id": "61ba4417591ee9186390a4f1",
  "isbn": "1408855658",
  "id": "harry-potter-and-the-philosopher's-stone",
  "title": "Harry Potter and the Philosopher's Stone ",
  "author": "JK Rowling",
  "pages": "384",
  "rating": "4.7",
  "votes": "8518",
  "description": "Turning the envelope over, his hand trembling, Harry saw a purple wax seal bearing a coat of arms; a lion, an eagle, a badger and a snake surrounding a large letter 'H'.\n\nHarry Potter has never even heard of Hogwarts when the letters start dropping on the doormat at number four, Privet Drive. Addressed in green ink on yellowish parchment with a purple seal, they are swiftly confiscated by his grisly aunt and uncle. Then, on Harry's eleventh birthday, a great beetle-eyed giant of a man called Rubeus Hagrid bursts in with some astonishing news: Harry Potter is a wizard, and he has a place at Hogwarts School of Witchcraft and Wizardry. An incredible adventure is about to begin!\nHaving now become classics of our time, the Harry Potter ebooks never fail to bring comfort and escapism to readers of all ages. With its message of hope, belonging and the enduring power of truth and love, the story of the Boy Who Lived continues to delight generations of new readers.",
  "tags": [
    "harry potter",
    "fiction",
    "fantasy",
    "best-seller"
  ],
  "series": "Harry Potter",
  "seriesIndex": "2",
  "cover": "https://m.media-amazon.com/images/I/51UoqRAxwEL.jpg",
  "price": 500,
  "reviews": [
    {
      "name": "Sushant Rawat",
      "rating": 5,
      "comment": "Enter the mesmerisign World of Harry Potter",
      "title": "World Wide Wizard"
    },
    {
      "name": "Rohit",
      "rating": 4,
      "comment": "The world has gone crazy with this book",
      "title": "Thr craziest Story"
    }
  ],
  "authorId": "jk-rowling"
},
{
  "_id": "61ba4417591ee9186390a4f3",
  "isbn": "9781408855706",
  "id": "harry-potter-and-the-half-blood-prince",
  "title": "Harry Potter and the Half Blood Prince",
  "author": "JK Rowling",
  "pages": "560",
  "rating": "4.7",
  "votes": "5651",
  "description": "",
  "tags": [
    "harry potter",
    "fiction",
    "fantasy",
    "best-seller"
  ],
  "series": "Harry Potter",
  "seriesIndex": "6",
  "cover": "https://cdn01.sapnaonline.com/product_media/9781408855706/md_9781408855706.jpg",
  "price": 413,
  "authorId": "jk-rowling",
  "reviews": []
},
{
  "_id": "61ba4417591ee9186390a4f7",
  "isbn": "9781509808694",
  "id": "kane-and-abel",
  "title": "Kane and Abel",
  "author": "Jeffrey Archer",
  "pages": "560",
  "rating": "4.7",
  "votes": "2367",
  "description": "They had only one thing in common . . .   William Lowell Kane and Abel Rosnovski: one the son of a Boston millionaire, the other of a penniless Polish immigrant. Two men born on the same day, on opposite sides of the world, their paths destined to cross in the ruthless struggle to build a fortune.   A memorable story, spanning sixty years, of two powerful men linked by an all-consuming hatred, brought together by fate to save – and finally destroy – each other.  ‘The ultimate novel of sibling rivalry’ Dan Brown",
  "tags": [
    "fiction",
    "classic",
    "chronology",
    "english"
  ],
  "series": "",
  "seriesIndex": "",
  "cover": "https://images-na.ssl-images-amazon.com/images/I/81Y8QLPFFlL.jpg",
  "price": 135,
  "authorId": "jeffrey-archer",
  "reviews": []
},
{
  "_id": "61ba4417591ee9186390a4f9",
  "isbn": "8129135728",
  "id": "half-girl-friend",
  "title": "Half Girl Friend",
  "author": "Chetan Bhagat",
  "pages": "280",
  "rating": "3.2",
  "votes": "8300",
  "description": "Half Girlfriend is an Indian English coming of age, young adult romance novel by Indian author Chetan Bhagat.[1] The novel, set in rural Bihar, New Delhi, Patna, and New York, is the story of a Bihari boy in quest of winning over the girl he loves.[2][3] This is Bhagat's sixth novel which was released on 1 October 2014[4] by Rupa Publications. The novel has also been published in Hindi[5] and Gujarati[6] versions as well.  Dedicated to \"non English-types\", as Chetan Bhagat wrote, the book divulges the sentiments and linguistic struggles of a backward rural Bhojpuri-laced Hindi-speaking boy from Bihar as he enrolls himself at the prestigious English-medium St. Stephen’s College, New Delhi, and falls in love with a \"high class English-speaking rich Delhi girl\" schooled at Modern School, New Delhi. The girl does not admit the relationship but agrees to be his \"half girlfriend\".[7] Chetan Bhagat commented, \"Half-Girlfriend, to me, is a unique Indian phenomenon, where boys and girls are not clear about their relationship status with each other. A boy may think he is more than friends with the girl, but the girl is still not his girlfriend. Hence, I thought we needed a term like 'Half girlfriend'. Because, in India, that is what most men get.\"[7]",
  "tags": [
    "fiction",
    "indian",
    "young adult",
    "college",
    "romance"
  ],
  "series": "",
  "seriesIndex": "",
  "cover": "https://images-na.ssl-images-amazon.com/images/I/712HEn9SNwL.jpg",
  "price": 242,
  "authorId": "chetan-bhagat",
  "reviews": []
},
{
  "_id": "61ba4417591ee9186390a4fa",
  "isbn": "1408894742",
  "id": "harry-potter-and-the-deathly-hallows",
  "title": "Harry Potter and the Deathly Hallows",
  "author": "JK Rowling",
  "pages": "640",
  "rating": "4.7",
  "votes": "7262",
  "description": "Harry Potter and the Deathly Hallows is a fantasy novel written by British author J. K. Rowling and the seventh and final novel of the Harry Potter series. It was released on 21 July 2007 in the United Kingdom by Bloomsbury Publishing, in the United States by Scholastic, and in Canada by Raincoast Books. The novel chronicles the events directly following Harry Potter and the Half-Blood Prince (2005) and the final confrontation between the wizards Harry Potter and Lord Voldemort.",
  "tags": [
    "harry potter",
    "fiction",
    "fantasy",
    "best-seller"
  ],
  "series": "Harry Potter",
  "seriesIndex": "7",
  "cover": "https://images-na.ssl-images-amazon.com/images/I/811t1pfIZXL.jpg",
  "price": 221,
  "authorId": "jk-rowling",
  "reviews": []
},
{
  "_id": "61ba4417591ee9186390a4fb",
  "title": "Rashmirathi",
  "isbn": "555555555",
  "id": "rashmirathi",
  "author": "Ramdhari Singh Dinkar",
  "price": 101,
  "tags": [
    "fiction",
    "indian-epic",
    "mahabharata",
    "poetry",
    "hindi"
  ],
  "cover": "https://rukminim1.flixcart.com/image/416/416/kcf4lu80/regionalbooks/h/s/w/rashmirathi-jnanpith-award-winner-1972-hindi-original-imaftjbmp73rjcfb.jpeg?q=70",
  "reviews": [],
  "rating": 3.3,
  "authorId": "ramdhari-singh-dinkar"
},
{
  "_id": "61ba4417591ee9186390a4fc",
  "title": "Kurukshetra",
  "isbn": "666666666",
  "id": "kurukshetra",
  "author": "Ramdhari Singh Dinkar",
  "price": 250,
  "tags": [
    "fiction",
    "indian-epic",
    "mahabharata",
    "poetry",
    "hindi"
  ],
  "cover": "https://images-eu.ssl-images-amazon.com/images/I/51rZ7I5lG8L._SY264_BO1,204,203,200_QL40_FMwebp_.jpg",
  "reviews": [],
  "rating": 3,
  "authorId": "ramdhari-singh-dinkar"
},
{
  "_id": "61ba4417591ee9186390a4fd",
  "title": "Malice",
  "isbn": "0349141061",
  "id": "malice",
  "author": "Keigo Higashino",
  "price": 298,
  "description": "Acclaimed bestselling novelist Kunihiko Hidaka is found brutally murdered in his home on the night before he's planning to leave Japan and relocate to Vancouver. His body is found in his office, in a locked room, within his locked house, by his wife and his best friend, both of whom have rock solid alibis. Or so it seemsPolice Detective Kyochiro Kaga recognizes Hidaka's best friend. Years ago when they were both teachers, they were colleagues at the same high school. Kaga went on to join the police force while Osamu Nonoguchi left to become a full-time writer, though with not nearly the success of his friend Hidaka. But Kaga thinks something is a little bit off with Nonoguchi's statement and investigates further, ultimately executing a search warrant on Nonoguchi's apartment. There he finds evidence that shows that the two writers' relationship was very different than the two claimed. Nonoguchi confesses to the murder, but that's only the beginning of the story. In a brilliantly realized tale of cat and mouse, the detective and the writer battle over the truth of the past and how events that led to the murder really unfolded. Which one of the two writers was ultimately guilty of malice?",
  "tags": [],
  "cover": "https://images-na.ssl-images-amazon.com/images/I/41FwqEu6AxL._SX309_BO1,204,203,200_.jpg",
  "reviews": [],
  "rating": 4.6,
  "authorId": "keigo-higashino"
},
{
  "_id": "61ba4417591ee9186390a4fe",
  "title": "The Devotion Of Suspect X",
  "isbn": "0349138737",
  "id": "the-devotion-of-suspect-x",
  "author": "Keigo Higashino",
  "price": 180,
  "description": "Yasuko Hanaoka accidentally kills her ex-husband, when circumstances rose to an unendurable level of ghastly behaviour from him. What follows is an elongated and witty brain-game between the investigator and her accomplice, Ishigami, who aided Yasuko in covering up the murder. The Devotion Of Suspect X is the story about an ingenious plotter, and clever Dr Manabu Yukawa, who helps in solving the case.\n\nYasuko Hanaoka works in a restaurant. She is divorced, and is a single mother to Misato. Her ex-husband, Togashi, was an abusive man, stalking and extorting money from her. With similar intentions, he showed up at Yasuko’s home, this time threatening to kill her and her daughter if she refused to lend him money. What started from denial, reached to a heated argument, and within a short span of time, turned to a nasty fight. In the spur of the moment, Yasuko killed Togashi. Hearing the commotion in their apartment, Tetsuya Ishigami came into the picture. Ishigami was a middle-aged, single math teacher, who evidently had a growing affection for Yasuko. He offered not only to help her dispose of the corpse, but also to devise a logical plan to cover up the entire incident.\n\nLater, the body was recovered from where it was disposed of. The principal investigator, Kusanagi, was certain of Yasuko’s involvement with the murder but was unable to find sufficient evidence. For a better insight, he summoned the assistance of the ingenious physicist, Dr Manabu Yukawa. Yukawa was a schoolfriend of Ishigami, and he suspected Ishigami. As the story progresses, there are more interesting twists and turns, keeping the readers thrilled and speculating.\n\nThe Devotion Of Suspect X was published by Abacus in 2012, and available is in paperback.\n\nKey Features:\n\nIt was also adapted into motion pictures in South Korea and Japan.",
  "tags": [],
  "cover": "https://images-na.ssl-images-amazon.com/images/I/51JBj367QwL._SX310_BO1,204,203,200_.jpg",
  "reviews": [],
  "rating": 4.1,
  "authorId": "keigo-higashino"
},
{
  "_id": "61ba4417591ee9186390a4ff",
  "title": "A Tale of Two Cities ",
  "isbn": "B09FDLR46V",
  "id": "a-tale-of-two-cities",
  "author": " Charles Dickens",
  "price": 150,
  "description": "A Tale of Two Cities (1859) is a historical novel by Charles Dickens, set in London and Paris before and during the French Revolution. The novel tells the story of the French Doctor Manette, his 18-year-long imprisonment in the Bastille in Paris and his release to live in London with his daughter Lucie, whom he had never met. The story is set against the conditions that led up to the French Revolution and the Reign of Terror.",
  "tags": [],
  "cover": "https://m.media-amazon.com/images/I/51HG8XU0QhL.jpg",
  "reviews": [],
  "rating": 4.9,
  "authorId": "charles-dickens"
},
{
  "_id": "61ba4417591ee9186390a500",
  "title": "The Lost Symbol",
  "isbn": "0552161233",
  "id": "the-lost-symbol",
  "author": "Dan Brown",
  "price": 317,
  "description": "‘Impossible to put down . . . Another mind-blowing Robert Langdon story’ New York Times\n\nA mysterious invitation brings Robert Langdon to Washington DC.\n\nThere, he is presented with a sequence of bloody clues which he must unravel if he is to prevent a terrible plan.\n\nBut all is not as it seems in this dangerous city – an ancient organisation will reassert its power once more. The only man standing in its way - Robert Langdon.",
  "tags": [],
  "cover": "https://images-na.ssl-images-amazon.com/images/I/51Zutc5AWcL._SX319_BO1,204,203,200_.jpg",
  "reviews": [],
  "rating": 3.6,
  "authorId": "dan-brown"
},
{
  "_id": "61bc58e8b521dbf73e6c0c96",
  "title": "Angels and Demons",
  "isbn": "11111",
  "author": "Dan Brown",
  "price": 100,
  "description": "",
  "tags": [],
  "cover": "",
  "authorId": "dan-brown",
  "reviews": [],
  "__v": 0,
  "id": "angels-and-demons"
},
{
  "_id": "6245782c2d4aba13215c32f1",
  "title": "Kane and Abel",
  "isbn": "1509808698",
  "id": "kane-and-abel",
  "author": "Jeffrey Archer",
  "price": 292,
  "description": "Jeffrey Archer's Kane and Abel was a global phenomenon when it was first released, selling over one million copies in its first week of sale, and it has captivated readers worldwide ever since. They had only one thing in common . . . William Lowell Kane and Abel Rosnovski, one the son of a Boston millionaire, the other a penniless Polish immigrant ? two men born on the same day on opposite sides of the world, their paths destined to cross in the ruthless struggle to build a fortune.Kane and Abel is the marvellous story, spanning sixty years, of two powerful men linked by an all-consuming hatred, brought together by fate to save . . . and finally destroy . . . each other. Jeffrey Archer's international bestseller is followed by the enthralling sequel, The Prodigal Daughter.",
  "tags": [],
  "cover": "https://images-eu.ssl-images-amazon.com/images/I/51Io01xRjsL._SY264_BO1,204,203,200_QL40_FMwebp_.jpg",
  "reviews": [],
  "__v": 0
},
{
  "_id": {
    "$oid": "62bebb750839c4dd0bc1d25d"
  },
  "title": "Fantastic Beasts and Where to Find Them",
  "isbn": "1408880717",
  "author": "JK Rowling",
  "price": 250,
  "description": "A brand new edition of this essential companion to the Harry Potter stories, with a new foreword from J.K. Rowling, an irresistible new jacket by Jonny Duddle and line illustrations by Tomislav Tomic. an approved textbook at Hogwarts School of Witchcraft and Wizardry since publication, Newt Scamander’s masterpiece has entertained wizarding families through the generations. Fantastic Beasts and Where to Find Them is an indispensable introduction to the magical beasts of the Wizarding World. in this comprehensively updated edition, eagle-eyed readers will spot a number of new beasts and an intriguing new author’s note. Scamander’s years of travel and research have created a tome of unparalleled importance. Some of the beasts will be familiar to readers of the Harry Potter books - the Hippogriff, the Basilisk, the Hungarian Horntail.. Others will surprise even the most ardent amateur Magizoologist. Dip in to discover the curious habits of magical beasts across five continents.‘No wizarding household is complete without a copy’ - Albus Dumbledore A Children’s Bookshelf Selection: Each month our editor’s pick the best books for children and young adults by age to be a part of the children’s bookshelf. These are editorial recommendations made by our team of experts. Our monthly reading list includes a mix of bestsellers and top new releases and evergreen books that will help enhance a child’s reading life.",
  "tags": [],
  "cover": "https://images-na.ssl-images-amazon.com/images/I/514S0rIdxeL._SX333_BO1,204,203,200_.jpg",
  "authorId": "jk-rowling",
  "reviews": [],
  "__v": 0
},
{
  "_id": {
    "$oid": "62bee2400f933272ade1c681"
  },
  "title": "Chamber",
  "isbn": "939393939393",
  "author": "jk-rowling",
  "price": 200,
  "description": "book 2 of the famous Harry Potter series and the description should be big enough",
  "tags": [],
  "cover": "cover.jpg",
  "authorId": "jk-rowling",
  "reviews": [],
  "__v": 0
},
{
  "_id": {
    "$oid": "66cd73f7232d0c1b0f485cfa"
  },
  "title": "Atomic Habbits",
  "id": "atomic-habbits",
  "author": "James Clear",
  "authorId": "james-clear",
  "cover": "atomic-habbits.png"
}]